case3/TemplateCase0.1/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
2500
(
-0.487159
-0.467275
-0.447391
-0.427507
-0.407623
-0.387739
-0.367855
-0.347971
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-0.497095
-0.491293
-0.485511
-0.479765
-0.474069
-0.468439
-0.462889
-0.457438
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
0.497095
0.491293
0.485511
0.479765
0.474069
0.468439
0.462889
0.457438
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-0.49
-0.47
-0.45
-0.43
-0.41
-0.39
-0.37
-0.35
...
)
;
    }
    down
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-0.49
-0.47
-0.45
-0.43
-0.41
-0.39
-0.37
-0.35
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
