case3/TemplateCase0.1/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
2500
(
-0.245384
-0.245384
-0.245384
-0.245384
-0.245384
-0.245384
-0.245384
-0.245384
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-0.245375
-0.236119
-0.22685
-0.217558
-0.208235
-0.198873
-0.189462
-0.179995
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-0.245375
-0.236119
-0.22685
-0.217558
-0.208235
-0.198873
-0.189462
-0.179995
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
0.25
0.25
0.25
0.25
0.25
0.25
0.25
0.25
...
)
;
    }
    down
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-0.25
-0.25
-0.25
-0.25
-0.25
-0.25
-0.25
-0.25
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
