case3/TemplateCase0.1/system/blockMeshDict
// Parametrized windTunnel

//Run using:
//m4 -P blockMeshDict.m4 > blockMeshDict

//m4 definitions:

//Mathematical constants:


//m4 spec:


//plane A settlingChamberInlet


//plane B contractionInlet


//plane C testSectionInlet


//plane D diffuserInlet


//plane E fanInlet


//plane F fanOutlet


//plane z:


//spline:


/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
	// front side
	(-0.5 -0.25 0) // Vertex A0 = 0 
	(0.5 -0.25 0) // Vertex B0 = 1 
	(0.5 0.25 0) // Vertex B1 = 2 
	(-0.5 0.25 0) // Vertex A1 = 3 

	// back side	
	(-0.5 -0.25 0.01) // Vertex A3 = 4 
	(0.5 -0.25 0.01) // Vertex B3 = 5 
	(0.5 0.25 0.01) // Vertex B2 = 6 
	(-0.5 0.25 0.01) // Vertex A2 = 7 

);

blocks          
(
    // stenosis domain	
    hex (0 1 2 3 4 5 6 7) (50 50 1) simpleGrading (1 1 1)
);

edges           
(
spline 0 3
(
(-4.938439093866057172e-01 -2.401960784313725561e-01 0.000000000000000000e+00)
(-4.877111709335286149e-01 -2.303921568627451122e-01 0.000000000000000000e+00)
(-4.816250482183429549e-01 -2.205882352941176405e-01 0.000000000000000000e+00)
(-4.756086279891622581e-01 -2.107843137254901966e-01 0.000000000000000000e+00)
(-4.696847325886956415e-01 -2.009803921568627527e-01 0.000000000000000000e+00)
(-4.638758333812846857e-01 -1.911764705882352811e-01 0.000000000000000000e+00)
(-4.582039655113216425e-01 -1.813725490196078372e-01 0.000000000000000000e+00)
(-4.526906443163989935e-01 -1.715686274509803932e-01 0.000000000000000000e+00)
(-4.473567837122643942e-01 -1.617647058823529493e-01 0.000000000000000000e+00)
(-4.422226168591748552e-01 -1.519607843137255054e-01 0.000000000000000000e+00)
(-4.373076194105893211e-01 -1.421568627450980338e-01 0.000000000000000000e+00)
(-4.326304356353442571e-01 -1.323529411764705899e-01 0.000000000000000000e+00)
(-4.282088076935557930e-01 -1.225490196078431460e-01 0.000000000000000000e+00)
(-4.240595083345292671e-01 -1.127450980392156743e-01 0.000000000000000000e+00)
(-4.201982772719760062e-01 -1.029411764705882304e-01 0.000000000000000000e+00)
(-4.166397614778880598e-01 -9.313725490196078649e-02 0.000000000000000000e+00)
(-4.133974596215561625e-01 -8.333333333333334259e-02 0.000000000000000000e+00)
(-4.104836708644937771e-01 -7.352941176470589868e-02 0.000000000000000000e+00)
(-4.079094482055046211e-01 -6.372549019607842702e-02 0.000000000000000000e+00)
(-4.056845565528722775e-01 -5.392156862745098311e-02 0.000000000000000000e+00)
(-4.038174356827181066e-01 -4.411764705882353921e-02 0.000000000000000000e+00)
(-4.023151682240398985e-01 -3.431372549019606755e-02 0.000000000000000000e+00)
(-4.011834527918740623e-01 -2.450980392156862364e-02 0.000000000000000000e+00)
(-4.004265823704965532e-01 -1.470588235294117974e-02 0.000000000000000000e+00)
(-4.000474280286633877e-01 -4.901960784313735831e-03 0.000000000000000000e+00)
(-4.000474280286633877e-01 4.901960784313708075e-03 0.000000000000000000e+00)
(-4.004265823704965532e-01 1.470588235294117974e-02 0.000000000000000000e+00)
(-4.011834527918740623e-01 2.450980392156865140e-02 0.000000000000000000e+00)
(-4.023151682240398985e-01 3.431372549019606755e-02 0.000000000000000000e+00)
(-4.038174356827181066e-01 4.411764705882353921e-02 0.000000000000000000e+00)
(-4.056845565528722219e-01 5.392156862745095536e-02 0.000000000000000000e+00)
(-4.079094482055046211e-01 6.372549019607842702e-02 0.000000000000000000e+00)
(-4.104836708644937771e-01 7.352941176470589868e-02 0.000000000000000000e+00)
(-4.133974596215561070e-01 8.333333333333331483e-02 0.000000000000000000e+00)
(-4.166397614778880598e-01 9.313725490196078649e-02 0.000000000000000000e+00)
(-4.201982772719760062e-01 1.029411764705882026e-01 0.000000000000000000e+00)
(-4.240595083345292671e-01 1.127450980392156743e-01 0.000000000000000000e+00)
(-4.282088076935557930e-01 1.225490196078431460e-01 0.000000000000000000e+00)
(-4.326304356353442571e-01 1.323529411764705621e-01 0.000000000000000000e+00)
(-4.373076194105893211e-01 1.421568627450980338e-01 0.000000000000000000e+00)
(-4.422226168591748552e-01 1.519607843137255054e-01 0.000000000000000000e+00)
(-4.473567837122643942e-01 1.617647058823529216e-01 0.000000000000000000e+00)
(-4.526906443163989935e-01 1.715686274509803932e-01 0.000000000000000000e+00)
(-4.582039655113216425e-01 1.813725490196078649e-01 0.000000000000000000e+00)
(-4.638758333812846857e-01 1.911764705882352811e-01 0.000000000000000000e+00)
(-4.696847325886956415e-01 2.009803921568627527e-01 0.000000000000000000e+00)
(-4.756086279891622581e-01 2.107843137254901689e-01 0.000000000000000000e+00)
(-4.816250482183429549e-01 2.205882352941176405e-01 0.000000000000000000e+00)
(-4.877111709335286149e-01 2.303921568627451122e-01 0.000000000000000000e+00)
(-4.938439093866057172e-01 2.401960784313725283e-01 0.000000000000000000e+00)
)
spline 4 7
(
(-4.938439093866057172e-01 -2.401960784313725561e-01 1.000000000000000021e-02)
(-4.877111709335286149e-01 -2.303921568627451122e-01 1.000000000000000021e-02)
(-4.816250482183429549e-01 -2.205882352941176405e-01 1.000000000000000021e-02)
(-4.756086279891622581e-01 -2.107843137254901966e-01 1.000000000000000021e-02)
(-4.696847325886956415e-01 -2.009803921568627527e-01 1.000000000000000021e-02)
(-4.638758333812846857e-01 -1.911764705882352811e-01 1.000000000000000021e-02)
(-4.582039655113216425e-01 -1.813725490196078372e-01 1.000000000000000021e-02)
(-4.526906443163989935e-01 -1.715686274509803932e-01 1.000000000000000021e-02)
(-4.473567837122643942e-01 -1.617647058823529493e-01 1.000000000000000021e-02)
(-4.422226168591748552e-01 -1.519607843137255054e-01 1.000000000000000021e-02)
(-4.373076194105893211e-01 -1.421568627450980338e-01 1.000000000000000021e-02)
(-4.326304356353442571e-01 -1.323529411764705899e-01 1.000000000000000021e-02)
(-4.282088076935557930e-01 -1.225490196078431460e-01 1.000000000000000021e-02)
(-4.240595083345292671e-01 -1.127450980392156743e-01 1.000000000000000021e-02)
(-4.201982772719760062e-01 -1.029411764705882304e-01 1.000000000000000021e-02)
(-4.166397614778880598e-01 -9.313725490196078649e-02 1.000000000000000021e-02)
(-4.133974596215561625e-01 -8.333333333333334259e-02 1.000000000000000021e-02)
(-4.104836708644937771e-01 -7.352941176470589868e-02 1.000000000000000021e-02)
(-4.079094482055046211e-01 -6.372549019607842702e-02 1.000000000000000021e-02)
(-4.056845565528722775e-01 -5.392156862745098311e-02 1.000000000000000021e-02)
(-4.038174356827181066e-01 -4.411764705882353921e-02 1.000000000000000021e-02)
(-4.023151682240398985e-01 -3.431372549019606755e-02 1.000000000000000021e-02)
(-4.011834527918740623e-01 -2.450980392156862364e-02 1.000000000000000021e-02)
(-4.004265823704965532e-01 -1.470588235294117974e-02 1.000000000000000021e-02)
(-4.000474280286633877e-01 -4.901960784313735831e-03 1.000000000000000021e-02)
(-4.000474280286633877e-01 4.901960784313708075e-03 1.000000000000000021e-02)
(-4.004265823704965532e-01 1.470588235294117974e-02 1.000000000000000021e-02)
(-4.011834527918740623e-01 2.450980392156865140e-02 1.000000000000000021e-02)
(-4.023151682240398985e-01 3.431372549019606755e-02 1.000000000000000021e-02)
(-4.038174356827181066e-01 4.411764705882353921e-02 1.000000000000000021e-02)
(-4.056845565528722219e-01 5.392156862745095536e-02 1.000000000000000021e-02)
(-4.079094482055046211e-01 6.372549019607842702e-02 1.000000000000000021e-02)
(-4.104836708644937771e-01 7.352941176470589868e-02 1.000000000000000021e-02)
(-4.133974596215561070e-01 8.333333333333331483e-02 1.000000000000000021e-02)
(-4.166397614778880598e-01 9.313725490196078649e-02 1.000000000000000021e-02)
(-4.201982772719760062e-01 1.029411764705882026e-01 1.000000000000000021e-02)
(-4.240595083345292671e-01 1.127450980392156743e-01 1.000000000000000021e-02)
(-4.282088076935557930e-01 1.225490196078431460e-01 1.000000000000000021e-02)
(-4.326304356353442571e-01 1.323529411764705621e-01 1.000000000000000021e-02)
(-4.373076194105893211e-01 1.421568627450980338e-01 1.000000000000000021e-02)
(-4.422226168591748552e-01 1.519607843137255054e-01 1.000000000000000021e-02)
(-4.473567837122643942e-01 1.617647058823529216e-01 1.000000000000000021e-02)
(-4.526906443163989935e-01 1.715686274509803932e-01 1.000000000000000021e-02)
(-4.582039655113216425e-01 1.813725490196078649e-01 1.000000000000000021e-02)
(-4.638758333812846857e-01 1.911764705882352811e-01 1.000000000000000021e-02)
(-4.696847325886956415e-01 2.009803921568627527e-01 1.000000000000000021e-02)
(-4.756086279891622581e-01 2.107843137254901689e-01 1.000000000000000021e-02)
(-4.816250482183429549e-01 2.205882352941176405e-01 1.000000000000000021e-02)
(-4.877111709335286149e-01 2.303921568627451122e-01 1.000000000000000021e-02)
(-4.938439093866057172e-01 2.401960784313725283e-01 1.000000000000000021e-02)
)
spline 1 2
(
(4.938439093866057172e-01 -2.401960784313725561e-01 0.000000000000000000e+00)
(4.877111709335286149e-01 -2.303921568627451122e-01 0.000000000000000000e+00)
(4.816250482183429549e-01 -2.205882352941176405e-01 0.000000000000000000e+00)
(4.756086279891622581e-01 -2.107843137254901966e-01 0.000000000000000000e+00)
(4.696847325886956415e-01 -2.009803921568627527e-01 0.000000000000000000e+00)
(4.638758333812846857e-01 -1.911764705882352811e-01 0.000000000000000000e+00)
(4.582039655113216425e-01 -1.813725490196078372e-01 0.000000000000000000e+00)
(4.526906443163989935e-01 -1.715686274509803932e-01 0.000000000000000000e+00)
(4.473567837122643942e-01 -1.617647058823529493e-01 0.000000000000000000e+00)
(4.422226168591748552e-01 -1.519607843137255054e-01 0.000000000000000000e+00)
(4.373076194105893211e-01 -1.421568627450980338e-01 0.000000000000000000e+00)
(4.326304356353442571e-01 -1.323529411764705899e-01 0.000000000000000000e+00)
(4.282088076935557930e-01 -1.225490196078431460e-01 0.000000000000000000e+00)
(4.240595083345292671e-01 -1.127450980392156743e-01 0.000000000000000000e+00)
(4.201982772719760062e-01 -1.029411764705882304e-01 0.000000000000000000e+00)
(4.166397614778880598e-01 -9.313725490196078649e-02 0.000000000000000000e+00)
(4.133974596215561625e-01 -8.333333333333334259e-02 0.000000000000000000e+00)
(4.104836708644937771e-01 -7.352941176470589868e-02 0.000000000000000000e+00)
(4.079094482055046211e-01 -6.372549019607842702e-02 0.000000000000000000e+00)
(4.056845565528722775e-01 -5.392156862745098311e-02 0.000000000000000000e+00)
(4.038174356827181066e-01 -4.411764705882353921e-02 0.000000000000000000e+00)
(4.023151682240398985e-01 -3.431372549019606755e-02 0.000000000000000000e+00)
(4.011834527918740623e-01 -2.450980392156862364e-02 0.000000000000000000e+00)
(4.004265823704965532e-01 -1.470588235294117974e-02 0.000000000000000000e+00)
(4.000474280286633877e-01 -4.901960784313735831e-03 0.000000000000000000e+00)
(4.000474280286633877e-01 4.901960784313708075e-03 0.000000000000000000e+00)
(4.004265823704965532e-01 1.470588235294117974e-02 0.000000000000000000e+00)
(4.011834527918740623e-01 2.450980392156865140e-02 0.000000000000000000e+00)
(4.023151682240398985e-01 3.431372549019606755e-02 0.000000000000000000e+00)
(4.038174356827181066e-01 4.411764705882353921e-02 0.000000000000000000e+00)
(4.056845565528722219e-01 5.392156862745095536e-02 0.000000000000000000e+00)
(4.079094482055046211e-01 6.372549019607842702e-02 0.000000000000000000e+00)
(4.104836708644937771e-01 7.352941176470589868e-02 0.000000000000000000e+00)
(4.133974596215561070e-01 8.333333333333331483e-02 0.000000000000000000e+00)
(4.166397614778880598e-01 9.313725490196078649e-02 0.000000000000000000e+00)
(4.201982772719760062e-01 1.029411764705882026e-01 0.000000000000000000e+00)
(4.240595083345292671e-01 1.127450980392156743e-01 0.000000000000000000e+00)
(4.282088076935557930e-01 1.225490196078431460e-01 0.000000000000000000e+00)
(4.326304356353442571e-01 1.323529411764705621e-01 0.000000000000000000e+00)
(4.373076194105893211e-01 1.421568627450980338e-01 0.000000000000000000e+00)
(4.422226168591748552e-01 1.519607843137255054e-01 0.000000000000000000e+00)
(4.473567837122643942e-01 1.617647058823529216e-01 0.000000000000000000e+00)
(4.526906443163989935e-01 1.715686274509803932e-01 0.000000000000000000e+00)
(4.582039655113216425e-01 1.813725490196078649e-01 0.000000000000000000e+00)
(4.638758333812846857e-01 1.911764705882352811e-01 0.000000000000000000e+00)
(4.696847325886956415e-01 2.009803921568627527e-01 0.000000000000000000e+00)
(4.756086279891622581e-01 2.107843137254901689e-01 0.000000000000000000e+00)
(4.816250482183429549e-01 2.205882352941176405e-01 0.000000000000000000e+00)
(4.877111709335286149e-01 2.303921568627451122e-01 0.000000000000000000e+00)
(4.938439093866057172e-01 2.401960784313725283e-01 0.000000000000000000e+00)
)
spline 5 6
(
(4.938439093866057172e-01 -2.401960784313725561e-01 1.000000000000000021e-02)
(4.877111709335286149e-01 -2.303921568627451122e-01 1.000000000000000021e-02)
(4.816250482183429549e-01 -2.205882352941176405e-01 1.000000000000000021e-02)
(4.756086279891622581e-01 -2.107843137254901966e-01 1.000000000000000021e-02)
(4.696847325886956415e-01 -2.009803921568627527e-01 1.000000000000000021e-02)
(4.638758333812846857e-01 -1.911764705882352811e-01 1.000000000000000021e-02)
(4.582039655113216425e-01 -1.813725490196078372e-01 1.000000000000000021e-02)
(4.526906443163989935e-01 -1.715686274509803932e-01 1.000000000000000021e-02)
(4.473567837122643942e-01 -1.617647058823529493e-01 1.000000000000000021e-02)
(4.422226168591748552e-01 -1.519607843137255054e-01 1.000000000000000021e-02)
(4.373076194105893211e-01 -1.421568627450980338e-01 1.000000000000000021e-02)
(4.326304356353442571e-01 -1.323529411764705899e-01 1.000000000000000021e-02)
(4.282088076935557930e-01 -1.225490196078431460e-01 1.000000000000000021e-02)
(4.240595083345292671e-01 -1.127450980392156743e-01 1.000000000000000021e-02)
(4.201982772719760062e-01 -1.029411764705882304e-01 1.000000000000000021e-02)
(4.166397614778880598e-01 -9.313725490196078649e-02 1.000000000000000021e-02)
(4.133974596215561625e-01 -8.333333333333334259e-02 1.000000000000000021e-02)
(4.104836708644937771e-01 -7.352941176470589868e-02 1.000000000000000021e-02)
(4.079094482055046211e-01 -6.372549019607842702e-02 1.000000000000000021e-02)
(4.056845565528722775e-01 -5.392156862745098311e-02 1.000000000000000021e-02)
(4.038174356827181066e-01 -4.411764705882353921e-02 1.000000000000000021e-02)
(4.023151682240398985e-01 -3.431372549019606755e-02 1.000000000000000021e-02)
(4.011834527918740623e-01 -2.450980392156862364e-02 1.000000000000000021e-02)
(4.004265823704965532e-01 -1.470588235294117974e-02 1.000000000000000021e-02)
(4.000474280286633877e-01 -4.901960784313735831e-03 1.000000000000000021e-02)
(4.000474280286633877e-01 4.901960784313708075e-03 1.000000000000000021e-02)
(4.004265823704965532e-01 1.470588235294117974e-02 1.000000000000000021e-02)
(4.011834527918740623e-01 2.450980392156865140e-02 1.000000000000000021e-02)
(4.023151682240398985e-01 3.431372549019606755e-02 1.000000000000000021e-02)
(4.038174356827181066e-01 4.411764705882353921e-02 1.000000000000000021e-02)
(4.056845565528722219e-01 5.392156862745095536e-02 1.000000000000000021e-02)
(4.079094482055046211e-01 6.372549019607842702e-02 1.000000000000000021e-02)
(4.104836708644937771e-01 7.352941176470589868e-02 1.000000000000000021e-02)
(4.133974596215561070e-01 8.333333333333331483e-02 1.000000000000000021e-02)
(4.166397614778880598e-01 9.313725490196078649e-02 1.000000000000000021e-02)
(4.201982772719760062e-01 1.029411764705882026e-01 1.000000000000000021e-02)
(4.240595083345292671e-01 1.127450980392156743e-01 1.000000000000000021e-02)
(4.282088076935557930e-01 1.225490196078431460e-01 1.000000000000000021e-02)
(4.326304356353442571e-01 1.323529411764705621e-01 1.000000000000000021e-02)
(4.373076194105893211e-01 1.421568627450980338e-01 1.000000000000000021e-02)
(4.422226168591748552e-01 1.519607843137255054e-01 1.000000000000000021e-02)
(4.473567837122643942e-01 1.617647058823529216e-01 1.000000000000000021e-02)
(4.526906443163989935e-01 1.715686274509803932e-01 1.000000000000000021e-02)
(4.582039655113216425e-01 1.813725490196078649e-01 1.000000000000000021e-02)
(4.638758333812846857e-01 1.911764705882352811e-01 1.000000000000000021e-02)
(4.696847325886956415e-01 2.009803921568627527e-01 1.000000000000000021e-02)
(4.756086279891622581e-01 2.107843137254901689e-01 1.000000000000000021e-02)
(4.816250482183429549e-01 2.205882352941176405e-01 1.000000000000000021e-02)
(4.877111709335286149e-01 2.303921568627451122e-01 1.000000000000000021e-02)
(4.938439093866057172e-01 2.401960784313725283e-01 1.000000000000000021e-02)
)
);




boundary
(
    left
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    right
    {
    	type patch;
    	faces
    	(
    		(2 6 5 1)
    	);
    }

    up
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }

    down
    {
        type patch;
        faces
        (
            //(0 4 7 3)
            //(2 6 5 1)
            (1 5 4 0)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);